---
kind: type
id: T:Autodesk.Revit.DB.GeometryElement
source: html/09eaeb08-58bb-8049-8925-f3a5aa846fdc.htm
---
# Autodesk.Revit.DB.GeometryElement

Geometric representation of an element.

## Syntax (C#)
```csharp
public class GeometryElement : GeometryObject,
	IEnumerable<GeometryObject>
```

## Remarks
This class contains geometric primitives that are generated from the
parametric description of the element. The member geometric primitives can be obtained
directly from this object using the capabilities of IEnumerable.